Catalogs/Договоры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Договоры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Договоры/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
	
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("НачалоДействия") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПоискПоДатеДокумента(ДанныеВыбора, Параметры);
		                                                                                                 
	КонецЕсли;
	
КонецПроцедуры
	
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = ?(Данные.Активен, 
		СтрШаблон("%1 (А)", Данные.Наименование), 
		СтрШаблон("%1 (%2)", Данные.Наименование, Формат(Данные.ОкончаниеДействия, "ДЛФ=Д")));
	
КонецПроцедуры
	
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("Активен");
	Поля.Добавить("ОкончаниеДействия");
	
КонецПроцедуры
	
#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции
	
// Делает отбор договоров при поиске по Наименованию или Коду. 
// Используется в документе Ведомость при заполнении таблицы ДоговорыВСтроке. 
//
// Параметры:
//  ДанныеВыбора  - параметры события 'ОбработкаПолученияДанныхВыбора'.
//  Параметры  - параметры события 'ОбработкаПолученияДанныхВыбора'.
//
Процедура ПоискПоДатеДокумента(ДанныеВыбора, Параметры)
	
	ДанныеВыбора = Новый СписокЗначений; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Договоры.Ссылка КАК Ссылка,
		|	Договоры.Код КАК Код,
		|	Договоры.Представление КАК Представление
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|ГДЕ
		|	Договоры.НачалоДействия <= &ДатаДокумента
		|	И Договоры.Наименование ПОДОБНО &СтрокаВвода";
	
	Если СтрПодобнаПоРегулярномуВыражению(Параметры.СтрокаПоиска, "^\d+$") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Договоры.Наименование", "Договоры.Код");
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("ДатаДокумента", Параметры.Отбор.НачалоДействия);
	Запрос.УстановитьПараметр("СтрокаВвода", Параметры.СтрокаПоиска + "%");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Индекс = -1;
	
	Если СтрПодобнаПоРегулярномуВыражению(Параметры.СтрокаПоиска, "^\d+$") Тогда
		
		Пока Выборка.Следующий() Цикл
			Индекс = Индекс + 1;
			ДанныеВыбора.Вставить(Индекс, Выборка.Ссылка, Выборка.Код + " " + "("+ Выборка.Представление +")");
		КонецЦикла;
		
	Иначе
		
		Пока Выборка.Следующий() Цикл
			Индекс = Индекс + 1;
			ДанныеВыбора.Вставить(Индекс, Выборка.Ссылка, Выборка.Представление + " " + "("+ Выборка.Код +")");
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
